// Mathが持つプロパティとメソッド
// プロパティ
//     ・E:ネイピア数
//     ・LN10:10の自然対数
//     ・LN2:2の自然対数
//     ・LOG2E:2を底としたEの対数
//     ・LOG10E:10を底としたEの対数
//     ・PI:円周率
//     ・SORT1_2:1/2の平方根
//     ・SORT2:2の平方根
// メソッド
//     ・abs(x)
//     ・acos(x)
//     ・asin(x)
//     ・atan(x)
//     ・atan2(y, x)
//     ・ceil(x)
//     ・cos(x)
//     ・exp(x):Eをxで累乗した数を返す
//     ・floor(x)
//     ・log(x):xの自然対数
//     ・max([value1[, value2 [,...]]])
//     ・min([value1[, value2 [,...]]])
//     ・pow(x, y):xをyで累乗した値
//     ・random():0以上1未満の値を返す。現在時刻をseedとする。
//     ・round(x):xの小数点第一位で四捨五入
//     ・sin(x)
//     ・sqrt(x)
//     ・tan(x)


//------------------------------------------------


//Mathオブジェクトの注意点
// ・Mathオブジェクトはコンストラクタを持たないので、インスタンス生成不可。
// ・Mathオブジェクトのプロパティは全て定数。またメソッドは全て静的メソッド。そのため変更不可。